In [ ]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import glob
import os

In [ ]:
stu_dent =pd.read_csv('studentlist.csv')
print(stu_dent.shape)
stu_dent.head(5)

(1017, 4)

   enrollmentnumber          admn     studentname  studentEmail
0        1613101016  16SCSE101757   AAYUSH  TYAGI           NaN
1        1613101026  16SCSE101415        ABHISHEK           NaN
2        1613101051  16SCSE101222    ADITI  SINGH           NaN
3        1613101054  16SCSE101220  ADITYA  MANKAR           NaN
4        1613101079  16SCSE101085   AKASH  KANSAL           NaN

In [ ]:
# Ques. 1:- Read the files present in the folders batchwiselist, quiz

In [ ]:
batch = r'C:\Users\saddam\Desktop\python homework\assignment3\Prob1\batchwiselist'
all_files = glob.glob(batch +"/*.csv")
lst = []
for i in all_files:
    df = pd.read_csv(i)
    lst.append(df)
    
tot_lst = pd.concat(lst)
print(tot_lst.shape)

(1017, 5)

In [ ]:

batch = r'C:\Users\saddam\Desktop\python homework\assignment3\Prob1\quiz'
all_files = glob.glob(batch +"/*.csv")

quiz = []

for i in all_files:
    df = pd.read_csv(i)
    quiz.append(df)
#define each csv
quiz1 = quiz[0]
quiz2 = quiz[1]
#2 file merged
bth_quiz = pd.concat(quiz)
bth_quiz.head(3)
quiz1 = quiz1.drop(columns=['ID number','Institution',"Department",'Email address'])
quiz2 = quiz2.drop(columns=['ID number','Institution',"Department",'Email address'])

In [ ]:
print(quiz1.shape)
quiz1.head(5)

(660, 7)

,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00
0,16BTCSES11,SIDDHANT GUPTA,Finished,08-02-2019 09:57,08-02-2019 10:11,14 mins 1 sec,4
1,16BTCSES11,ARPIT SHARMA,Finished,08-02-2019 09:57,08-02-2019 10:11,14 mins 5 secs,5
2,16BTCSES11,VISHAL SINGH,Finished,08-02-2019 09:57,14-02-2019 10:10,6 days,7
3,16BTCSES11,AKASH YADAV,Finished,08-02-2019 09:57,14-02-2019 12:03,6 days 2 hours,9
4,16BTCSES11,MANISH SAHANI,Finished,08-02-2019 09:57,08-02-2019 23:09,13 hours 11 mins,7

In [ ]:
stat_df= pd.DataFrame (columns = ["no of present", "lessthan50", "between50and60", 
                                  "between60and70", "between70and80", "greaterthan80"],index=["Quiz_1","Quiz_2"])

stat_df

,no of present,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,NaN,NaN,NaN,NaN,NaN,NaN
Quiz_2,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
quiz1["Firstname"] = quiz1["Firstname"].dropna()
quiz2["Firstname"] = quiz2["Firstname"].dropna()

In [ ]:
#quiz1["Grade/10.00"].unique()
#quiz2["Grade/10.00"].unique()
quiz1["Grade/10.00"] = quiz1["Grade/10.00"].str.replace("-","0")
quiz2["Grade/10.00"] = quiz2["Grade/10.00"].str.replace("-","0")
quiz1["Grade/10.00"] = quiz1["Grade/10.00"].apply(pd.to_numeric)
quiz2["Grade/10.00"] = quiz2["Grade/10.00"].apply(pd.to_numeric)

In [ ]:
#quiz11 = quiz1[quiz1["Grade/10.00"]<5].reset_index()
quiz1[quiz1["Grade/10.00"]<5]["Firstname"].count()
quiz2[quiz2["Grade/10.00"]<5]["Firstname"].count()

93

In [ ]:
quiz1.count()

Surname        660
Firstname      659
State          659
Started on     659
Completed      659
Time taken     659
Grade/10.00    660
dtype: int64

In [ ]:
quiz2.count()

Surname        681
Firstname      680
State          680
Started on     680
Completed      680
Time taken     680
Grade/10.00    681
dtype: int64

In [ ]:
stat_df["no of present"]= [quiz1["Firstname"].count(),quiz2["Firstname"].count()]
stat_df["lessthan50"] = [quiz1[quiz1["Grade/10.00"].between(0,4.9,inclusive=True)]["Firstname"].count(),
                         quiz2[quiz2["Grade/10.00"].between(0,4.9)]["Firstname"].count()]
stat_df["between50and60"] = [quiz1[quiz1["Grade/10.00"].between(5,5.9,inclusive=True)]["Firstname"].count(),
                             quiz2[quiz2["Grade/10.00"].between(5,5.9,inclusive=True)]["Firstname"].count()]
stat_df["between60and70"] = [quiz1[quiz1["Grade/10.00"].between(6,6.9,inclusive=True)]["Firstname"].count(),
                             quiz2[quiz2["Grade/10.00"].between(6,6.9,inclusive=True)]["Firstname"].count()]
stat_df["between70and80"] = [quiz1[quiz1["Grade/10.00"].between(7,7.9,inclusive=True)]["Firstname"].count(),
                             quiz2[quiz2["Grade/10.00"].between(7,7.9,inclusive=True)]["Firstname"].count()]
stat_df["greaterthan80"] = [quiz1[quiz1["Grade/10.00"].between(8,10,inclusive=True)]["Firstname"].count(),
                            quiz2[quiz2["Grade/10.00"].between(8,10,inclusive=True)]["Firstname"].count()]


stat_df

,no of present,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,659,127,69,57,58,348
Quiz_2,680,93,40,39,41,467

In [ ]:
batch = r'C:\Users\saddam\Desktop\python homework\assignment3\Prob1\batchwiselist'
all_files = glob.glob(batch +"/*.csv")
all_files[0]
file = []
for i in all_files:
    df = pd.read_csv(i)
    file.append(df)

In [ ]:
quiz_1 = pd.merge(quiz1,stu_dent,left_on='Firstname',right_on='studentname',how='right')
quiz_2 = pd.merge(quiz2,stu_dent,left_on='Firstname',right_on='studentname',how='right')
print(quiz_1.shape)
quiz_1["Grade/10.00"] = quiz_1["Grade/10.00"].fillna(0)
quiz_2["Grade/10.00"] = quiz_2["Grade/10.00"].fillna(0)

(1017, 11)

In [ ]:

#quiz-1
n = 18
b_q1 = []
for i in range(n+1):
    qz = pd.merge(file[i],quiz_1,left_on='studentName',right_on='studentname',how='left')
    b_q1.append(qz)

print(b_q1[0].shape)
b_q1[0].head(3)

#quiz-2
b_q2 = []
for i in range(n+1):
    qz = pd.merge(file[i],quiz_2,left_on='studentName',right_on='studentname',how='left')
    b_q2.append(qz)

print(b_q2[0].shape)
b_q1[0].head(3)

(63, 16)
(63, 16)

,Unnamed: 0,srNo,enrollmentNumber,admissionNumber,studentName,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00,enrollmentnumber,admn,studentname,studentEmail
0,0,1,1613101016,16SCSE101757,AAYUSH TYAGI,16BTCSES1,AAYUSH TYAGI,Finished,08-02-2019 15:59,08-02-2019 16:06,7 mins 14 secs,5.0,1613101016,16SCSE101757,AAYUSH TYAGI,NaN
1,1,2,1613101026,16SCSE101415,ABHISHEK,16BTCSES1,ABHISHEK,Finished,08-02-2019 16:06,08-02-2019 16:22,15 mins 41 secs,7.0,1613101026,16SCSE101415,ABHISHEK,NaN
2,2,3,1613101051,16SCSE101222,ADITI SINGH,16BTCSES1,ADITI SINGH,Finished,08-02-2019 16:21,08-02-2019 16:37,16 mins 52 secs,5.0,1613101051,16SCSE101222,ADITI SINGH,NaN

In [ ]:
result1= pd.DataFrame (columns = ["no of present", "lessthan50", "between50and60", 
                                  "between60and70", "between70and80", "greaterthan80"],index=["Quiz_1","Quiz_2"])
result1

,no of present,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,NaN,NaN,NaN,NaN,NaN,NaN
Quiz_2,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:

result1["no of present"]= [b_q1[0]["studentName"].count(),b_q2[0]["studentName"].count()]
result1["lessthan50"] = [b_q1[0][b_q1[0]["Grade/10.00"].between(0,4.9,inclusive=True)]["studentName"].count(),
                         b_q2[0][b_q2[0]["Grade/10.00"].between(0,4.9)]["studentName"].count()]
result1["between50and60"] = [b_q1[0][b_q1[0]["Grade/10.00"].between(5,5.9,inclusive=True)]["studentName"].count(),
                             b_q2[0][b_q2[0]["Grade/10.00"].between(5,5.9,inclusive=True)]["studentName"].count()]
result1["between60and70"] = [b_q1[0][b_q1[0]["Grade/10.00"].between(6,6.9,inclusive=True)]["studentName"].count(),
                             b_q2[0][b_q2[0]["Grade/10.00"].between(6,6.9,inclusive=True)]["studentName"].count()]
result1["between70and80"] = [b_q1[0][b_q1[0]["Grade/10.00"].between(7,7.9,inclusive=True)]["studentName"].count(),
                             b_q2[0][b_q2[0]["Grade/10.00"].between(7,7.9,inclusive=True)]["studentName"].count()]
result1["greaterthan80"] = [b_q1[0][b_q1[0]["Grade/10.00"].between(8,10,inclusive=True)]["studentName"].count(),
                            b_q2[0][b_q2[0]["Grade/10.00"].between(8,10,inclusive=True)]["studentName"].count()]

result1

,no of present,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,63,24,10,4,5,20
Quiz_2,63,25,3,1,0,34

In [ ]:
rst = []

for i in range(n+1):
    result= pd.DataFrame (columns = ["no of present", "lessthan50", "between50and60", 
                                  "between60and70", "between70and80", "greaterthan80"],index=["Quiz_1","Quiz_2"])
    result["no of present"]= [b_q1[i]["studentname"].count(),b_q2[i]["studentName"].count()]
    result["lessthan50"] = [b_q1[i][b_q1[i]["Grade/10.00"].between(0,4.9,inclusive=True)]["studentName"].count(),b_q2[i][b_q2[i]["Grade/10.00"].between(0,4.9)]["studentName"].count()]
    result["between50and60"] = [b_q1[i][b_q1[i]["Grade/10.00"].between(5,5.9,inclusive=True)]["studentName"].count(),b_q2[i][b_q2[i]["Grade/10.00"].between(5,5.9,inclusive=True)]["studentName"].count()]
    result["between60and70"] = [b_q1[i][b_q1[i]["Grade/10.00"].between(6,6.9,inclusive=True)]["studentName"].count(),b_q2[i][b_q2[i]["Grade/10.00"].between(6,6.9,inclusive=True)]["studentName"].count()]
    result["between70and80"] = [b_q1[i][b_q1[i]["Grade/10.00"].between(7,7.9,inclusive=True)]["studentName"].count(),b_q2[i][b_q2[i]["Grade/10.00"].between(7,7.9,inclusive=True)]["studentName"].count()]
    result["greaterthan80"] = [b_q1[i][b_q1[i]["Grade/10.00"].between(8,10,inclusive=True)]["studentName"].count(),b_q2[i][b_q2[i]["Grade/10.00"].between(8,10,inclusive=True)]["studentName"].count()]
    rst.append(result)
    
rst[0]

,no of present,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,63,24,10,4,5,20
Quiz_2,63,25,3,1,0,34

In [ ]:
txt= pd.read_csv('C:\\Users\\saddam\\Desktop\\python homework\\assignment3\\Prob1\\testcaseStudent.txt',header=None,names=["inputs"])
txt

          inputs
0              2
1          1.csv
2  greaterthan80
3          9.csv
4     lessthan50

In [ ]:
tst_cs = int(txt.iloc[0,0])
ind = []
for i in range(tst_cs*2+1):
    ind.append(i)
    
ind

[0, 1, 2, 3, 4]

In [ ]:
file_name = ind[1::2]
column = ind[2::2]
print(file_name)
print(column)

[1, 3]
[2, 4]

In [ ]:
v = []
for i in file_name:
    x = txt.iloc[i,0]
    y = int(x[0])
    v.append(y)
#sub -1 to match index
a = [i - 1 for i in v]

c = []
for i in column:
    x = txt.iloc[i,0]
    c.append(x)

print(v)
print(c)
v

[1, 9]
['greaterthan80', 'lessthan50']

[1, 9]

In [ ]:
for (x,y) in zip(a,c):
    print(rst[x][y])
    print([x])

Quiz_1    20
Quiz_2    34
Name: greaterthan80, dtype: int64
[0]
Quiz_1    33
Quiz_2    16
Name: lessthan50, dtype: int64
[8]

In [ ]:
for (x,y,z) in zip(a,c,v):
    out = "Output{}.txt".format(z)
    f = open(out, "a")
    print(rst[x][y], file=f)
    print(f)

<_io.TextIOWrapper name='Output1.txt' mode='a' encoding='cp1252'>
<_io.TextIOWrapper name='Output9.txt' mode='a' encoding='cp1252'>